do

function run (msg, matches)

local reply_id = msg ['id']
if matches[1]==  'مساعدة' and is_momod(msg) then
local omar = [[🔋 ⚡️ RealBot√ ⚡️ 🔋

📌🔶➖🔶➖🔷➖🔶➖🔷📌

📫 /مساعدة1 :: عرض اوامر الترقية
📪 /مساعدة2 :: عرض اوامر العامة
📪 /مساعدة3 :: عرض اوامر الطرد
📪 /مساعدة4 :: عرض اوامر التنظيف
📪 /مساعدة5 :: عرض اوامر الميديا
📪 /مساعدة6 :: عرض اوامر الترحيب
📪 /اوامر التحذير :: لعرض اوامر التحذير

🏴المطور :: لعرض المطور 🔭


📌🔶➖🔶➖🔷➖🔶➖🔷📌

]]
..'\n' 
..'〰 اسم المجموعة  : '..msg.to.title..'\n'
..'📅 التاريخ : '.. os.date('!%A %B:%d:%Y\n', timestamp)
reply_msg(reply_id, omar, ok_cb, false)
end
local reply_id = msg ['id']
if matches[1]== 'مساعدة' and not is_momod(msg) then
    local omar = 'للمشرفين فقط'
    reply_msg(reply_id, omar, ok_cb, false)
    end
local reply_id = msg ['id']
if matches[1]==  'مساعدة4' and is_momod(msg) then
local help4 = [[📜 ⚡️🔋 Real<>Bot √ ⚡️🔋
🔆✨✨✨✨✨✨✨✨🔆

📱 /امسح الوصف :: تنظيف الوصف
📱 /امسح القوانين :: تنظيف القوانين
📱 /امسح الادمنية :: تنظيف المشرفين
📱 /امسح المكتومين :: تنظيف المكتومين
📱 /امسح المعرف :: حذف معرف المجموعة

♣️✨✨✨✨✨✨✨✨♣️
]]
..'\n' 
..'〰 اسم المجموعة  : '..msg.to.title..'\n'
..'📅 التاريخ : '.. os.date('!%A %B:%d:%Y\n', timestamp)
reply_msg(reply_id, help4, ok_cb, false)
end
local reply_id = msg ['id']
if matches[1]== 'مساعدة4' and not is_momod(msg) then
    local help = 'للمشرفين فقط'
    reply_msg(reply_id, help, ok_cb, false)
    end
local reply_id = msg ['id']
if matches[1]==  'مساعدة3' and is_momod(msg) then
local help3 = [[ 📜 ⚡️ Real<>Bot√ ⚡️ 

✅ ☁️☁️☁️☁️☁️☁️☁️ ✅

➿ /اطرد :: طرد عضو
➿ /مغادرة للخروج من المجموعة
➿ /حضر ::  حظر عضو
➿ /الغاء الحضر :: الغاء الحظر عن العضو 
➿ /صامت :: وضع العضو على صامت
➿ /قائمة الكتم :: مشاهدة المكتومين
⤵
⤵
🔱 /منع - حضر كلمة
🔱 /سماح - للسماح في الكلمة
🔱 /الكلمات المحضورة :: قائمة الكملات المحضورة
🔱 /ازالة الكلمات المحضورة :: لأزالة جميع الكلمات المحضورة
🔱 /ايدي :: لاضهار الايدي الخاص بك
🔱 /معلومات :: اضهار معلومات المجموعة

✅ ☁️☁️☁️☁️☁️☁️☁️ ✅

]]
..'\n' 
..'〰 اسم المجموعة  : '..msg.to.title..'\n'
..'📅 التاريخ : '.. os.date('!%A %B:%d:%Y\n', timestamp)
reply_msg(reply_id, help3, ok_cb, false)
end

local reply_id = msg ['id']
if matches[1]==  'مساعدة5' and is_momod(msg) then
local help5 =[[📜 ⚡️ Real<>Bot√ ⚡️ 

🔶 اوامر قفل وسائظ المجموعة 🔒✅

🔒 /اقفل الصور :: لمنع ارسال الصور في المجموعة 
🔒 /اقفل الروابط :: لمنع ارسال الاعلانات 
🔒 /اقفل اعادة التوجيه :: لمنع اعادة توجيه 
🔒 /اقفل الاضافة :: لقفل الاضافة 
🔒 /اقفل الكلايش الطويلة :: لقف الكلايش
🔒 /اقفل التكرار :: لمنع التكرار 
🔒 /اقفل الصور المتحركة :: لمنع من ارسال الصور المتحركة 
🔒 /اقفل الملصقات  :: لمنع من ارسال الملصقات 
🔒 /اقفل جهات الاتصال  :: لمنع ارسال جهات الاتصال 
🔒 /اقفل الاشعارات :: لمنع الاصافة الجماعية 
🔒 /اقفل الصوتيات ::لمنع من ارسال الصوتيات 
🔒 /اقفل الفديوات :: لمنع من ارسال الفيدويهات 
🔒 /اقفل المحادثة ::  لمنع جميع الوسائط 
🔒 /اقفل النص :: لقفل محادثة المجموعة 
🔒 /اقفل الميديا قفل الميديا 

💯•••••••••••••••••💯

🔶 اوامر الفتح وسائظ المجموعة 🔓✅

🔶 افتح الروابط/   :: الغاء قفل الاعلانات 
🔶 /افتح اعاادة التوجيه :: الغاء منع اعادة توجيه 
🔶 /افتح الاضافة :: الغاء قفل الاضافة 
🔶 /افتح الكلايش الطويلة :: لفتح الكلايش
🔶 /افتح التكرار :: الغاء قفل التكرار 
🔶 /افتح الصور المتحركة ::  الغاء قفل منع الصور المتحركة 
🔶 /افتح الملصقات :: الغاء قفل الملصقات 
🔶 /افتح جهات الاتصال :: الغاء قفل جهات الاتصال
🔶 /افتح الاشعارات :: الغاء قفل الاضافه الجماعية 
🔶 /افتح الصوتيات :: الغاء قفل الرسائل الصورتيه
🔶 /افتح الصور :: الغاء قفل الصور 
🔶 /افتح الفديوات :: الغاء قفل الفيديوهات 
🔶 /افتح المحادثة :: الغاء قفل جميع الوسائظ 
🔶 /افتح النص :: الغاء قفل المحادثة
🔶 /افتح الميديا  ::  كك الغاء قفل الميديا 

 ]]
..'\n' 
..'〰 اسم المجموعة  : '..msg.to.title..'\n'
..'📅 التاريخ : '.. os.date('!%A %B:%d:%Y\n', timestamp)
reply_msg(reply_id, help5, ok_cb, false)
end
if matches[1]==  'مساعدة2' and is_momod(msg) then
local help2 = [[📜 ⚡️ Real<>Bot √ ⚡️ 
🕤➖➖➖➖➖➖➖➖🕤

🔷 /القوانين :: لأظهار القوانين 
🔷 /الوصف :: لأظهار الوصف 
🔷 /شع الوصف :: لوضع وصف
🔷 /ضع القوانين :: لوضع قوانين
🔷 /ضع الصورة :: وضع صورة
🔷 /ضع الاسم :: وضع اسم
🔷 /ضع التكرار :: تتعيين التكرار
🔷 /الرابط :: لاظهار الرابط
🔷 /غير الرابط :: تغيير الرابط
🔷 /اضافت رابط :: وضع رابط يدوي
🔷 /الرابط خاص :: لجلب الرابط خاص
🔷 /اضافة ملاحضة :: لاضافة ملاحضة
🔷 /ازالة الملاحضة :: لازالة الملاحضة
🔷 /الملاحضة :: لعرض الملاحضة

🎗➖➖➖➖➖➖➖➖🎗
 ]]
..'\n' 
..'〰 اسم المجموعة  : '..msg.to.title..'\n'
..'📅 التاريخ : '.. os.date('!%A %B:%d:%Y\n', timestamp)
reply_msg(reply_id, help2, ok_cb, false) 
end
local reply_id = msg ['id']
if matches[1]==  'مساعدة1' and is_momod(msg) then
local help1 = [[📜 ⚡️ Real<>Bot √ ⚡️ 
✔〰〰〰〰〰〰〰〰✔

📛 /ترقية :: تعيين مدير 
📛 /المدير :: لعرض المدير
📛 /ارفع ادمن :: تعيين مشرف 
📛 /ازالة :: تنزيل مشرف
📛 /الادمنية :: لعرض المشرفين

✔〰〰〰〰〰〰〰〰✔
 ]]
..'\n' 
..'〰 اسم المجموعة  : '..msg.to.title..'\n'
..'📅 التاريخ : '.. os.date('!%A %B:%d:%Y\n', timestamp)
reply_msg(reply_id, help1, ok_cb, false)
end

local reply_id = msg ['id']
if matches[1]==  'مساعدة6' and is_momod(msg) then
local omar = [[📜 ⚡️ Real<>Bot √ ⚡️ 
✔〰〰〰〰〰〰〰✔

📛 /ازالة التوديع :: حذف التوديع
📛 /ازالة الترحيب :: حذف ال ترحيب
📛 /ضع التوديع :: لوضع التوديع
📛 /ضع الترحيب :: لوضع الترحيب
📛 /الترحيب :: عرض الترحيب
📛 /التوديع :: لعرض التوديع

✔〰〰〰〰〰〰〰〰✔
 ]]
..'\n' 
..'〰 اسم المجموعة  : '..msg.to.title..'\n'
..'📅 التاريخ : '.. os.date('!%A %B:%d:%Y\n', timestamp)
reply_msg(reply_id, omar, ok_cb, false)
end 
local reply_id = msg ['id']
if matches[1]==  'المطور' then 
local omar = [[
〰 المطور ❕ 
🏴 المعرف : @iu5ui 🏴
🏴 معرف البوت : @CHAT4_BOT 🏴
]]
reply_msg(reply_id, omar, ok_cb, false)
end 
local reply_id = msg ['id']
if matches[1]==  'اوامر التحذير' then 
local omar = [[
📜 ⚡️ Real<>Bot √ ⚡️ 

اوامر التحذير 📄 في المجموعة 👥🔒

✔️〰〰〰〰〰〰〰✔️

📛 /تحذير الصور :: لقفل الصور
📛 /الغاء تحذير الصور  :: لقتح الصور
📛 /تحذير الصوتيات :: لقفل الصوتيات
📛 /الغاء تحذير الصوتيات :: لفتح الصوتيات
📛 /تحذير الفديوات :: لقفل الفديوات
📛 /الغاء تحذير الفديوات :: لفتح الفديوات
📛 /تحذير الروابط :: لقفل الروابط
📛 /الغاء تحذير الروابط :: لفتح الروابط
📛 /تحذير اعادة التوجيه :: للقفل  
📛 /الغاء تحذير اعادة التوجيه :: للفتح  
📛 /تحذير الميديا :: لقفل الميديا
📛 /الغاء تحذير الميديا :: لفتح الميديا

✔️〰〰〰〰〰〰〰〰✔️
]]
..'\n' 
..'〰 اسم المجموعة  : '..msg.to.title..'\n'
..'📅 التاريخ : '.. os.date('!%A %B:%d:%Y\n', timestamp)
reply_msg(reply_id, omar, ok_cb, false)
end
end
return {
patterns = {
"^[!/#](مساعدة)$",
"^[!/#](مساعدة)$",
"^[!/#](مساعدة4)$",
"^[!/#](مساعدة3)$",
"^[!/#](مساعدة5)$",
"^[!/#](مساعدة2)$",
"^[!/#](مساعدة1)$",
"^[!/#](مساعدة6)$",
"^(المطور)$",
"^[!/#](اوامر التحذير)$",
},
run = run
}
end